In [1]:
import pandas as pd

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

In [3]:
titanic = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv')

# 컬럼 1개 선택

In [4]:
ages = titanic['Age']
ages

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [5]:
titanic.shape

(891, 12)

In [6]:
len(titanic)

891

In [7]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [8]:
len(titanic.columns)

12

# 컬럼 2개 이상 선택

In [12]:
age_sex = titanic[['Age','Sex']]
age_sex
# cols = ['Age,'Sex]
# age_sex =  titanic[cols]

      Age     Sex
0    22.0    male
1    38.0  female
2    26.0  female
3    35.0  female
4    35.0    male
..    ...     ...
886  27.0    male
887  19.0  female
888   NaN  female
889  26.0    male
890  32.0    male

[891 rows x 2 columns]

In [13]:
print(type(ages))
print(type(age_sex))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>